#this is the function for random names. last name is same but diffrent list and format.
import random
def generate_first_name(min_length=None, max_length=None, seed=None):
    FIRST_NAMES = [
    "Анна", "Иван", "Мария", "Петр", "Елена", "Алексей", "Ольга", "Дмитрий","Наталья", "Сергей", "Андрей", "Екатерина", "Максим", "Татьяна", "Никита","Алина", "Виктор", "Полина", "Кирилл", "София", "Артем", "Дарья", "Роман","Валерия", "Михаил", "Юлия", "Владимир", "Ксения", "Илья", "Вероника","Глеб", "Анастасия", "Денис", "Марина", "Егор", "Ирина", "Руслан","Светлана", "Вадим", "Надежда", "Тимур", "Любовь", "Станислав", "Евгения","Георгий", "Лариса", "Матвей", "Вера", "Арсений", "Галина", "Лев","Диана", "Павел", "Милана", "Степан", "Виктория", "Ярослав", "Кристина","Федор", "Александра", "Борис", "Таисия", "Константин", "Ульяна","Леонид", "Элина", "Семен", "Карина", "Вячеслав", "Алиса", "Григорий","Жанна", "Даниил", "Нина", "Марк", "Зоя", "Тихон", "Лидия", "Анатолий","Яна", "Василий", "Оксана", "Игнат", "Раиса", "Ростислав", "Алла","Прохор", "Инна", "Филипп", "Майя", "Герман", "Регина", "Юрий", "Эмилия", "Олег", "Арина", "Платон", "Елизавета", "Савелий", "Лилия"]
    min_length = int(input("min length  "))
    max_length = int(input("max length  "))
    good_names = []
    no_good_names = []
    for name in FIRST_NAMES:
        if min_length<=len(name)<=max_length:
            good_names.append(name)
        else:
            no_good_names.append(name)
    print(random.choice(good_names))
#generate_first_name()

#this is the function for random names. last name is same but diffrent list and format.
import random
def generate_first_name(min_length=None, max_length=None, seed=None):
    LAST_NAMES = ["Иванов", "Петров", "Сидорова", "Смирнова", "Кузнецов", "Попов", "Васильев", "Соколов", "Михайлова", "Новикова", "Федоров", "Морозов", "Волкова", "Алексеева", "Лебедев", "Семенов", "Егорова", "Павлова", "Козлов", "Степанов", "Николаева", "Орлова", "Андреев", "Макарова", "Никитин", "Захарова", "Зайцев", "Соловьева", "Борисов", "Яковлева", "Григорьев", "Романова", "Воробьев", "Сергеева", "Кузьмина", "Фролов", "Александрова", "Дмитриев", "Королева", "Гусев", "Киселева", "Ильин", "Максимова", "Полякова", "Сорокин", "Виноградова", "Ковалев", "Белов", "Медведева", "Антонова", "Тарасов", "Жукова", "Баранов", "Филиппова", "Комаров", "Давыдова", "Беляев", "Герасимова", "Богданов", "Осипова", "Сидоров", "Матвеева", "Титов", "Маркова", "Миронов", "Крылова", "Куликов", "Карпова", "Власов", "Мельникова", "Денисов", "Гаврилова", "Тихонов", "Казанцева", "Афанасьев", "Быкова", "Савельев", "Ефимова", "Чернов", "Фомина", "Абрамов", "Наумова", "Мартынов", "Рогова", "Елисеев", "Прохорова", "Голубев", "Панина", "Кондратьев", "Суханова", "Лазарев", "Маслова", "Блинов", "Рябова", "Гордеев", "Ершова", "Зимин", "Широкова", "Котов", "Тимофеева"]
    min_length = int(input("min length  "))
    max_length = int(input("max length  "))
    good_names = []
    no_good_names = []
    for name in LAST_NAMES:
        if min_length<=len(name)<=max_length:
            good_names.append(name)
        else:
            no_good_names.append(name)
    print(random.choice(good_names))
#generate_first_name()

